app/views/gigs/show.html.erb

      <ul>
        <% @gig.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" INNER JOIN "abilities" ON "skills"."id" = "abilities"."skill_id" WHERE "abilities"."gig_id" = $1